{"type":"data","nodes":[{"type":"data","data":[{"globalDirectories":1,"searchConfig":80},[2,14,35,68],{"name":3,"path":4,"title":5,"url":6,"subpages":7},"blog","content/blog","Blog","/blog",[8,11],{"title":9,"url":10},"Static Sites, Stupid Simple","/blog/static-sites-stupid-simple",{"title":12,"url":13},"Introducing the Statue Component Library","/blog/statue-component-library",{"name":15,"path":16,"title":17,"url":18,"subpages":19},"contributing","content/contributing","Contributing","/contributing",[20,23,26,29,32],{"title":21,"url":22},"Adding Components to Statue","/contributing/ADDING_COMPONENTS",{"title":24,"url":25},"Adding Templates to Statue","/contributing/ADDING_TEMPLATES",{"title":27,"url":28},"Adding Themes to Statue","/contributing/ADDING_THEMES",{"title":30,"url":31},"Contributing to Statue SSG","/contributing/CONTRIBUTING",{"title":33,"url":34},"Developer Guide","/contributing/DEVELOPMENT",{"name":36,"path":37,"title":38,"url":39,"subpages":40},"docs","content/docs","Docs","/docs",[41,44,47,50,53,56,59,62,65],{"title":42,"url":43},"Statue SSG","/docs/README",{"title":45,"url":46},"Components","/docs/components",{"title":48,"url":49},"Getting Started with Statue","/docs/get-started",{"title":51,"url":52},"New Site Checklist","/docs/new-site-checklist",{"title":54,"url":55},"Routing","/docs/routing",{"title":57,"url":58},"Site Configuration","/docs/site-config",{"title":60,"url":61},"Templates","/docs/templates",{"title":63,"url":64},"Themes","/docs/themes",{"title":66,"url":67},"Troubleshooting Statue Setup","/docs/troubleshooting",{"name":69,"path":70,"title":71,"url":72,"subpages":73},"legal","content/legal","Legal","/legal",[74,77],{"title":75,"url":76},"Privacy Policy","/legal/privacy-policy",{"title":78,"url":79},"Terms of Use","/legal/terms",{"enabled":81,"placeholder":82,"noResultsText":83,"debounceMs":84,"minQueryLength":85,"maxResults":86,"showCategories":81,"showDates":81,"showExcerpts":81,"excerptLength":87},true,"Search...","No results found",300,2,10,30],"uses":{}},{"type":"data","data":[{"content":1,"directories":13,"sidebarItems":33},{"slug":2,"path":3,"url":4,"directory":5,"mainDirectory":5,"depth":6,"content":7,"metadata":8},"statue-component-library","blog/statue-component-library.md","/blog/statue-component-library","blog",1,"\n\u003Cp>We’re excited to introduce the \u003Ca href=\"https://statue.dev/components/\">Statue Component Library\u003C/a>, our growing collection of completely free, production-ready Svelte components you can add to your project with zero hassle.\u003C/p>\n\u003Cp>If you’ve ever browsed a component gallery only to find yourself buried in configuration steps and missing dependencies, you’re going to love this. Since each component is built with Statue in mind, they behave exactly as you would expect within your Statue site. Our goal is to provide beautiful components without complex setup. What you see is literally what you get.\u003C/p>\n\u003Chr>\n\u003Ch2>Why We Built It\u003C/h2>\n\u003Cp>While experimenting with other UI libraries on Statue sites, we kept running into the same exhausting pattern: a component would look perfect in the demo, then require an hour of configuration wrestling just to match what we&#39;d seen in the gallery. We&#39;d have to import this CSS file, add these props, install these peer dependencies, override these default styles—by the time we got it working. We&#39;d spent more time fighting the component than actually building.\u003C/p>\n\u003Cp>That frustration pushed us to create something more dependable. We wanted components that leaned into Statue&#39;s strengths: simplicity and clarity with no bait-and-switch between demo and reality. No configuration archaeology to figure out why your button doesn&#39;t look like their button. Just components that work exactly as shown, immediately.\u003C/p>\n\u003Chr>\n\u003Ch2>What’s Inside\u003C/h2>\n\u003Cp>The Statue Component Library already includes a selection of frequently needed UI pieces, and we&#39;re excited to release new components as Statue grows and develops.\u003C/p>\n\u003Cp>What&#39;s inside:\u003C/p>\n\u003Cul>\n\u003Cli>Core interactive elements such as buttons, forms, and inputs\u003C/li>\n\u003Cli>Navigation pieces that slot naturally into any layout\u003C/li>\n\u003Cli>Layout helpers for structuring pages without heavy styling\u003C/li>\n\u003Cli>Content blocks including cards, lists, and media elements\u003C/li>\n\u003Cli>Site accents like announcement banners and simple footers\u003C/li>\n\u003C/ul>\n\u003Cp>Every component has been designed to be clean, accessible, and ready to use without a pile of configuration. Of course, you still can still customize any component to your heart&#39;s content, but you don’t have to.\u003C/p>\n\u003Chr>\n\u003Ch2>What You See Is What You Get\u003C/h2>\n\u003Cp>This idea drives the entire library, as every component appears in the gallery exactly as it will appear in your project without hidden style packages or props you have to decode. All you need to do is copy it, drop it into a file, and keep moving.\u003C/p>\n\u003Cp>Each component displayed in Statue&#39;s library is actually rendered within Statue.dev, meaning you can always be assured that any component listed has been tested on a live, production Statue site. Simply import any component directly from statue-ssg. For example:\u003C/p>\n\u003Cpre>\u003Ccode>&lt;script lang=&quot;ts&quot;&gt;\nimport {BuiltBy} from &#39;statue-ssg&#39;;\n// your typescript\n&lt;/script&gt;\n&lt;!-- your svelte --&gt;\n&lt;BuiltBy builtInIcon={&quot;/favicon.png&quot;} /&gt;\n&lt;!-- the rest of your svelte --&gt;\n\u003C/code>\u003C/pre>\n\u003Cp>Alternatively, install Statue with \u003Ccode>npm install statue-ssg\u003C/code>, and every component in our library becomes available to your project immediately. This works in any Svelte project, not just sites built with Statue. Whether you&#39;re using SvelteKit, Vite, or any other Svelte setup, the components just work.\u003C/p>\n\u003Cp>Our focus is on making Statue&#39;s component library a true plug-and-play experience. Just import it and keep building.\u003C/p>\n\u003Chr>\n\u003Ch2>Contributing Your Own Components\u003C/h2>\n\u003Cp>The Statue Component Library thrives on community contributions, and we genuinely want your components. If you&#39;ve built something useful for your own Statue site, there&#39;s a good chance others would benefit from it too.\u003C/p>\n\u003Cp>Contributing is simple. Since Statue components are just standard Svelte files with minimal dependencies, you&#39;re likely already 90% of the way there if you&#39;ve created something for your own project. Write a single component, make sure it works in your Statue site, and submit it. That&#39;s it.\u003C/p>\n\u003Cp>We actively review and merge community contributions. Our bar for inclusion is straightforward: does it work well in a Statue site, is the code reasonably clean, and would others find it useful? If the answer is yes, we want it in the library.\u003C/p>\n\u003Cp>Whether it&#39;s a date picker you built last week, a custom card layout that solved a specific problem, or a navigation pattern you&#39;re particularly proud of—submit it. We&#39;ll work with you to get it merged. The library grows stronger with each contribution, and we&#39;re committed to making the process as friction-free as possible.\u003C/p>\n\u003Cp>Check out our \u003Ca href=\"https://github.com/accretional/statue?tab=contributing-ov-file\">contribution guidelines\u003C/a> to get started, or open an issue to discuss an idea before you build it. We&#39;re here to help make your component library-ready.\u003C/p>\n\u003Chr>\n\u003Ch2>Start Building Faster\u003C/h2>\n\u003Cp>The Component Library is available today, and new additions will roll out over time. Explore the gallery, pick something that fits your next project, and place it right into your Statue site. It is meant to be that straightforward.\u003C/p>\n",{"title":9,"description":10,"date":11,"author":12},"Introducing the Statue Component Library","Components just got even easier","2025-12-8","Brant Feick",[14,18,23,28],{"name":5,"path":15,"title":16,"url":17},"content/blog","Blog","/blog",{"name":19,"path":20,"title":21,"url":22},"contributing","content/contributing","Contributing","/contributing",{"name":24,"path":25,"title":26,"url":27},"docs","content/docs","Docs","/docs",{"name":29,"path":30,"title":31,"url":32},"legal","content/legal","Legal","/legal",[]],"uses":{"params":["slug"]}}]}
