{"type":"data","nodes":[{"type":"data","data":[{"globalDirectories":1},[2,11,20],{"name":3,"path":4,"title":5,"url":6,"subpages":7},"blog","content/blog","Blog","/blog",[8],{"title":9,"url":10},"Static Sites, Stupid Simple","/blog/static-sties-stupid-simple",{"name":12,"path":13,"title":14,"url":15,"subpages":16},"docs","content/docs","Docs","/docs",[17],{"title":18,"url":19},"Getting Started with Statue","/docs/get-started",{"name":21,"path":22,"title":23,"url":24,"subpages":25},"legal","content/legal","Legal","/legal",[26,29,32],{"title":27,"url":28},"Do Not Sell or Share My Personal Information","/legal/do-not-sell",{"title":30,"url":31},"Privacy Policy","/legal/privacy-policy",{"title":33,"url":34},"Terms of Use","/legal/terms"],"uses":{}},{"type":"data","data":[{"directories":1,"directoryContent":17,"subDirectories":30,"currentDirectory":2},[2,7,12],{"name":3,"path":4,"title":5,"url":6},"blog","content/blog","Blog","/blog",{"name":8,"path":9,"title":10,"url":11},"docs","content/docs","Docs","/docs",{"name":13,"path":14,"title":15,"url":16},"legal","content/legal","Legal","/legal",[18],{"slug":19,"path":20,"url":21,"directory":3,"mainDirectory":3,"depth":22,"content":23,"metadata":24},"static-sties-stupid-simple","blog/static-sties-stupid-simple.md","/blog/static-sties-stupid-simple",1,"\u003Ch2>Static Sites, Stupid Simple\u003C/h2>\n\u003Cp>Anyone who’s ever tried to make a website from scratch knows two things:\u003C/p>\n\u003Col>\n\u003Cli>I want it to work now.\u003C/li>\n\u003Cli>I don&#39;t want it to break tomorrow.\u003C/li>\n\u003C/ol>\n\u003Cp>That’s the whole philosophy behind Statue. It doesn’t try to be a Swiss Army knife with any number of useless attachments that will never see action. Instead, it&#39;s more like the humble screwdriver you keep in the kitchen drawer because it always does exactly what you need. You write some Markdown, tweak a few Svelte files, and suddenly you’re staring at a real website. It&#39;s fast, and it&#39;s reliable.\u003C/p>\n\u003Cp>There are plenty of static site generators out there, but Statue is designed to feel clearer. With very little guesswork, you know where the files live and what each one does. When something inevitably breaks, you know exactly what file needs correcting. You spend less time fiddling and more time actually making the website you envisioned. \u003C/p>\n\u003Cp>If you want a technical deep dive, we’ve included that within our documentation. This post is about what it feels like to actually build something with Statue.\u003C/p>\n\u003Chr>\n\u003Ch2>Your First Steps\u003C/h2>\n\u003Cp>Starting a Statue project is as simple as copying this command into your terminal.\u003C/p>\n\u003Cpre>\u003Ccode>yes | npx sv create . --template minimal --types ts --no-add-ons --install npm &amp;&amp; npm install statue-ssg &amp;&amp; npx statue init &amp;&amp; npm install &amp;&amp; npm run dev\n\u003C/code>\u003C/pre>\n\u003Cp>Just like that, a new Statue project is written to your directory, and a local site appears in your browser. Obviously, you&#39;ll need to make some updates to your project unless you, for whatever reason, want to make a Statue SSG website. If that is the case, thanks for the free advertising.\u003C/p>\n\u003Cp>Looking at your project directory, you will not find files named things like “config-helper-legacy-backup” that you’re terrified to delete or edit. Everything is arranged with a clear logic that makes you feel like maybe, making your new website won&#39;t be such a headache.\u003C/p>\n\u003Chr>\n\u003Ch2>Customizing Your Site\u003C/h2>\n\u003Cp>Let&#39;s say I want to customize my new site to represent the most exciting and unique product I can possibly think of, IT consulting services. The current site is nice, but right now it has all the personality of a default static site generator landing page. We can change that.\u003C/p>\n\u003Cp>Open \u003Ccode>src/routes/+page.svelte\u003C/code> and get creative. With Statue&#39;s built in component library, we can start dropping in a services section, a few testimonials, and even a button pointing to \u003Ccode>/case-studies\u003C/code> that will link to a new case studies section.\u003C/p>\n\u003Cp>Hop into the \u003Ccode>content/\u003C/code> folder and create a new directory called \u003Ccode>case-studies\u003C/code>. Statue immediately understands what you’re doing, and your aforementioned button and header get a working link to the new section without you having to think about it. Just add your first case study as a Markdown file to the \u003Ccode>content/case-studies/\u003C/code> directory, and suddenly, your site starts to feel real.\u003C/p>\n\u003Chr>\n\u003Ch2>Making the Whole Site Feel Cohesive\u003C/h2>\n\u003Cp>Once you’ve added your content, you might notice your theme looks a bit mismatched. The landing page is on one wavelength, the other pages are on another, and the color palette has no cohesion. DO NOT PANIC.\u003C/p>\n\u003Cp>You can shape the theme in \u003Ccode>src/routes/[...slug]/+page.svelte\u003C/code> and \u003Ccode>src/routes/[directory]/+page.svelte\u003C/code> until everything matches. A quick update to \u003Ccode>src/routes/about/+page.svelte\u003C/code> pulls the about page into the same aesthetic.\u003C/p>\n\u003Cp>For the final touch, head into \u003Ccode>src/lib/index.css\u003C/code> and swap in one of Statue’s default themes. Since we&#39;re already on a blue kick, we&#39;ll just use the \u003Ccode>statue-ssg/themes/blue.css\u003C/code> theme.\u003C/p>\n\u003Chr>\n\u003Ch2>Deploying to Cloudflare Pages\u003C/h2>\n\u003Cp>When your site looks good and you’re ready to send it out into the world, deployment is as easy as building the initial project. You run two commands in your terminal and out comes a public link.\u003C/p>\n\u003Cpre>\u003Ccode>npm install wrangler &amp;&amp; wrangler login\n\u003C/code>\u003C/pre>\n\u003Cpre>\u003Ccode>npm run build &amp;&amp; npx wrangler pages deploy build --project-name=myfirstwebsite\n\u003C/code>\u003C/pre>\n\u003Cp>Congrats, your site is live.\u003C/p>\n\u003Chr>\n\u003Ch2>Why Statue Hits Different\u003C/h2>\n\u003Cp>Many frameworks emphasize the speed and power of their advanced features. Statue has those, but its real magic is how it feels to use. It is clear and frictionless, and you get to build the site you want no matter your level of expertise.\u003C/p>\n\u003Cp>Statue is not just a tool for making websites. We made it to be a tool that makes the process enjoyable, which might be the most underrated feature in all of web development.\u003C/p>\n",{"title":25,"description":26,"date":27,"author":28,"category":29,"order":22},"Static Sites, Stupid Simple","Statue is any webdev's best friend",["Date","2025-11-21T00:00:00.000Z"],"Brant Feick","statue",[]],"uses":{"params":["directory"]}}]}
